/****************************************/
/**/
/*
*/
// /* //

/*
// Имя
A abc a1 a_1  a_b_1_2 _ __ x_ y__

// Ключевое слово
asam union void while

// Символ
-> +++ .* <<= ::

// Число целое
123 01234567 0123456789 0x1 0xff
1u 2U 3L 4l 5UL 6LU 7ul 8lu 9Lu 10lU 11Ul 12uL 13Ul 14ul
//0x

// Число вещественное (double, long double, float)
1.23 .1 1. 1E6 1.E6 1.2E-3
1.23f .1F 1.l 1E6L 1.E6 1.2E-3
//1E
//2E-

// Символ
'x' ' ' //'ab'
//''
'\n' '\t' '\r' '\\' '\'' '\"'
'\1' '\12' '\123' //'\8'
'\x1' '\xff' //'\x' */

// Строка
"hello"; "a"; "\n\r\\\'\"";
"Wow" "!"
"\""\
"\
\
\
" \
 \
\
"" ""
\
123 \
 \
2\
E\
+\
25\
\
 \
2\
L\
l\
u\
\
0\
x\
1\
1\
l\
u\

'\x\
1\
\
\
2\
\
\
\
'\
' '

+\
=

/\
=

/\
*\
privet\
cool *\
\
/

_\
_\
\
ide\
\
n\
t\
\
\
1\
2